CSI API ETABS v1
cDCoSP63133302011.GetPreference Method
 Retrieves the value of a concrete design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDCoSP63133302011
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 47, inclusive, indicating the preference item considered.
Multi-response case design
Number of interaction curves
Number of interaction points
Consider minimum eccentricity
Consider torsion
(qsw,1*Z1)/(Rs*As,1)
Corner rebar fraction top
Corner rebar fraction bottom
Relative Humidity (%)
Moisture Content (fraction)
Gamma_b
Gamma_bt
Gamma_b1 Short Term
Gamma_b1 Long Term
Gamma_b2
Gamma_b3 Beams
Gamma_b3 Columns
Gamma_b4
Gamma_b5
Gamma_S
Gamma_S1
Pattern Live Load Factor
Utilization Factor Limit
Live Load Duration Factor
Snow Load Duration Factor
Reliability Factor, Gamma_n
Seismic Factor, m_tr,strength
Seismic Factor, m_tr,shear
Site Seismicity
Ignore Beneficial Pu for Beam Design
Consider Crack Analysis
Crack Width Limit Full Load, a_crc,ult (mm)
Crack Width Limit Long Term, a_crc,l,ult (mm)
Longitudinal Rebar Size Top
Longitudinal Rebar Size Bottom
Is Longitudinal Rebar Ribbed
User Defined Allowable PT Stresses
Concrete Strength Ratio at Transfer f'ci / f'c
Transfer: Top Fiber Tensile Stress / f'ci^(1/2)
Transfer: Bottom Fiber Tensile Stress / f'ci^(1/2)
Transfer: Extreme Fiber Compressive Stress / f'ci
Final: Top Fiber Tensile Stress / f'c^(1/2)
Final: Bottom Fiber Tensile Stress / f'c^(1/2)
Final: Extreme Fiber Compressive Stress / f'c
Sustained: Extreme Fiber Compressive Stress / f'c
Sustained: Fraction of Live Load Considered
Value
Type: System.Double
 The value of the considered preference item.
 Multi-response case design
1 = Envelopes
2 = Step-by-Step
3 = Last Step
4 = Enveleopes -- All
5 = Step-by-Step -- All
 Number of interaction curves
 Value >= 4 and divisable by 4
 Number of interaction points
 Value >= 5 and odd
 Consider minimum eccentricity
0 = No
Any other value = Yes
 Consider torsion
0 = No
Any other value = Yes
 (qsw,1*Z1)/(Rs*As,1)
 Value > 0
 Corner rebar fraction top
 Value > 0
 Corner rebar fraction bottom
 Value > 0
 Relative Humidity (%)
 Value > 0
 Moisture Content (fraction)
 Value > 0
 Gamma_b
 Value > 0
 Gamma_bt
 Value > 0
 Gamma_b1 Short Term
 Value > 0
 Gamma_b1 Long Term
 Value > 0
 Gamma_b2
 Value > 0
 Gamma_b3 Beams
 Value > 0
 Gamma_b3 Columns
 Value > 0
 Gamma_b4
 Value > 0
 Gamma_b5
 Value > 0
 Gamma_b4
 Value > 0
 Gamma_S
 Value > 0
 Gamma_S1
 Value > 0
 Pattern Live Load Factor
 Value > 0
 Utilization Factor Limit
 Value > 0
 Live Load Duration Factor
 Value > 0
 Snow Load Duration Factor
 Value > 0
 Reliability Factor, Gamma_n
 Value > 0
 Seismic Factor, m_tr,strength
 Value > 0
 Seismic Factor, m_tr,shear
 Value > 0
 Site Seismicity
1 = Site Seismicity 9
2 = Site Seismicity 8
3 = Site Seismicity 7
4 = Non-seismic
 Ignore Beneficial Pu for Beam Design
0 = No
Any other value = Yes
 Consider Crack Analysis
0 = No
Any other value = Yes
 Crack Width Limit Full Load, a_crc,ult (mm)
 Value > 0
 Crack Width Limit Long Term, a_crc,l,ult (mm)
 Value > 0
 Longitudinal Rebar Size Top
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Longitudinal Rebar Size Bottom
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Is Longitudinal Rebar Ribbed
0 = No
Any other value = Yes
 User Defined Allowable PT Stresses
0 = No
Any other value = Yes
 Concrete Strength Ratio at Transfer f'ci / f'c
 Value > 0
 Transfer: Top Fiber Tensile Stress / f'ci^(1/2)
 Value > 0
 Transfer: Bottom Fiber Tensile Stress / f'ci^(1/2)
 Value > 0
 Transfer: Extreme Fiber Compressive Stress / f'ci
 Value > 0
 Final: Top Fiber Tensile Stress / f'c^(1/2)
 Value > 0
 Final: Bottom Fiber Tensile Stress / f'c^(1/2)
 Value > 0
 Final: Extreme Fiber Compressive Stress / f'c
 Value > 0
 Sustained: Extreme Fiber Compressive Stress / f'c
 Value > 0
 Sustained: Fraction of Live Load Considered
 Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("SP 63.13330.2012")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'get preference item
   ret = SapModel.DesignConcrete.SP63133302011.GetPreference(35, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoSP63133302011 Interface
ETABSv1 Namespace